yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostwbc.h
/* Peripheral clock gating register 1 */
__IO_REG8    (CLK_PCKENR1, 0x50C7, __READ_WRITE);
/* Clock security system register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CSSEN       : 1;
  unsigned char AUX         : 1;
  unsigned char CSSDIE      : 1;
  unsigned char CSSD        : 1;
} __BITS_CLK_CSSR;
#endif
__IO_REG8_BIT(CLK_CSSR,    0x50C8, __READ_WRITE, __BITS_CLK_CSSR);

/* Configurable clock control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCOEN       : 1;
  unsigned char CCOSEL      : 4;
  unsigned char CCORDY      : 1;
  unsigned char CCOBSY      : 1;
} __BITS_CLK_CCOR;
#endif
__IO_REG8_BIT(CLK_CCOR,    0x50C9, __READ_WRITE, __BITS_CLK_CCOR);

/* Peripheral clock gating register 2 */
__IO_REG8    (CLK_PCKENR2, 0x50CA, __READ_WRITE);
/* HSI clock calibration trimming register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char HSITRIM     : 4;
} __BITS_CLK_HSITRIMR;
#endif
__IO_REG8_BIT(CLK_HSITRIMR, 0x50CC, __READ_WRITE, __BITS_CLK_HSITRIMR);

/* SWIM clock control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SWIMCLK     : 1;
} __BITS_CLK_SWIMCCR;
#endif
__IO_REG8_BIT(CLK_SWIMCCR, 0x50CD, __READ_WRITE, __BITS_CLK_SWIMCCR);

/* CCO divider register */
__IO_REG8    (CLK_CCODIVR, 0x50CE, __READ_WRITE);
/* ADC clock configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEL         : 2;
  unsigned char             : 2;
  unsigned char ADC_DIV     : 4;
} __BITS_CLK_ADCR;
#endif
__IO_REG8_BIT(CLK_ADCR,    0x50CF, __READ_WRITE, __BITS_CLK_ADCR);


/*-------------------------------------------------------------------------
 *      Clock Registers bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define CLK_SMED0_CK_SW0         CLK_SMED0_bit.CK_SW0
#define CLK_SMED0_CK_SW1         CLK_SMED0_bit.CK_SW1
#define CLK_SMED0_SMED_0_DIV     CLK_SMED0_bit.SMED_0_DIV

#define CLK_SMED1_CK_SW0         CLK_SMED1_bit.CK_SW0
#define CLK_SMED1_CK_SW1         CLK_SMED1_bit.CK_SW1
#define CLK_SMED1_SMED_1_DIV     CLK_SMED1_bit.SMED_1_DIV

#define CLK_SMED2_CK_SW0         CLK_SMED2_bit.CK_SW0
#define CLK_SMED2_CK_SW1         CLK_SMED2_bit.CK_SW1
#define CLK_SMED2_SMED_2_DIV     CLK_SMED2_bit.SMED_2_DIV

#define CLK_SMED3_CK_SW0         CLK_SMED3_bit.CK_SW0
#define CLK_SMED3_CK_SW1         CLK_SMED3_bit.CK_SW1
#define CLK_SMED3_SMED_3_DIV     CLK_SMED3_bit.SMED_3_DIV

#define CLK_SMED4_CK_SW0         CLK_SMED4_bit.CK_SW0
#define CLK_SMED4_CK_SW1         CLK_SMED4_bit.CK_SW1
#define CLK_SMED4_SMED_4_DIV     CLK_SMED4_bit.SMED_4_DIV

#define CLK_SMED5_CK_SW0         CLK_SMED5_bit.CK_SW0
#define CLK_SMED5_CK_SW1         CLK_SMED5_bit.CK_SW1
#define CLK_SMED5_SMED_5_DIV     CLK_SMED5_bit.SMED_5_DIV

#define CLK_PLLDIVR_PLL_DIV      CLK_PLLDIVR_bit.PLL_DIV
#define CLK_PLLDIVR_PLL_PRES_DIV CLK_PLLDIVR_bit.PLL_PRES_DIV

#define CLK_AWUDIVR_AWUDIV0      CLK_AWUDIVR_bit.AWUDIV0
#define CLK_AWUDIVR_AWUDIV1      CLK_AWUDIVR_bit.AWUDIV1
#define CLK_AWUDIVR_AWUDIV2      CLK_AWUDIVR_bit.AWUDIV2
#define CLK_AWUDIVR_AWUDIV3      CLK_AWUDIVR_bit.AWUDIV3

#define CLK_ICKR_HSIEN           CLK_ICKR_bit.HSIEN
#define CLK_ICKR_HSIRDY          CLK_ICKR_bit.HSIRDY
#define CLK_ICKR_FHW             CLK_ICKR_bit.FHW
#define CLK_ICKR_LSIEN           CLK_ICKR_bit.LSIEN
#define CLK_ICKR_LSIRDY          CLK_ICKR_bit.LSIRDY
#define CLK_ICKR_REGAH           CLK_ICKR_bit.REGAH

#define CLK_ECKR_HSEEN           CLK_ECKR_bit.HSEEN
#define CLK_ECKR_HSERDY          CLK_ECKR_bit.HSERDY

#define CLK_PLLR_PLLON           CLK_PLLR_bit.PLLON
#define CLK_PLLR_LOCKP           CLK_PLLR_bit.LOCKP
#define CLK_PLLR_REF_SEL         CLK_PLLR_bit.REF_SEL
#define CLK_PLLR_BYPASS          CLK_PLLR_bit.BYPASS
#define CLK_PLLR_SSCG_CTRL       CLK_PLLR_bit.SSCG_CTRL
#define CLK_PLLR_SPREAD_CTRL     CLK_PLLR_bit.SPREAD_CTRL
#define CLK_PLLR_PLL_LOCK_INT    CLK_PLLR_bit.PLL_LOCK_INT

#define CLK_CMSR_CKM             CLK_CMSR_bit.CKM
#define CLK_CMSR_NCKM            CLK_CMSR_bit.NCKM

#define CLK_SWR_SWI              CLK_SWR_bit.SWI
#define CLK_SWR_NSWI             CLK_SWR_bit.NSWI

#define CLK_SWCR_SWBSY           CLK_SWCR_bit.SWBSY
#define CLK_SWCR_SWEN            CLK_SWCR_bit.SWEN
#define CLK_SWCR_SWIEN           CLK_SWCR_bit.SWIEN
#define CLK_SWCR_SWIF            CLK_SWCR_bit.SWIF

#define CLK_DIVR_CPUDIV          CLK_DIVR_bit.CPUDIV
#define CLK_DIVR_HSIDIV          CLK_DIVR_bit.HSIDIV

#define CLK_CSSR_CSSEN           CLK_CSSR_bit.CSSEN
#define CLK_CSSR_AUX             CLK_CSSR_bit.AUX
#define CLK_CSSR_CSSDIE          CLK_CSSR_bit.CSSDIE
#define CLK_CSSR_CSSD            CLK_CSSR_bit.CSSD

#define CLK_CCOR_CCOEN           CLK_CCOR_bit.CCOEN
#define CLK_CCOR_CCOSEL          CLK_CCOR_bit.CCOSEL
#define CLK_CCOR_CCORDY          CLK_CCOR_bit.CCORDY
#define CLK_CCOR_CCOBSY          CLK_CCOR_bit.CCOBSY

#define CLK_HSITRIMR_HSITRIM     CLK_HSITRIMR_bit.HSITRIM

#define CLK_SWIMCCR_SWIMCLK      CLK_SWIMCCR_bit.SWIMCLK

#define CLK_ADCR_SEL             CLK_ADCR_bit.SEL
#define CLK_ADCR_ADC_DIV         CLK_ADCR_bit.ADC_DIV

#endif

/*-------------------------------------------------------------------------
 *      Clock Registers bit masks
 *-----------------------------------------------------------------------*/
#define MASK_CLK_SMED0_CK_SW0    0x01
#define MASK_CLK_SMED0_CK_SW1    0x02
#define MASK_CLK_SMED0_SMED_0_DIV 0x70

#define MASK_CLK_SMED1_CK_SW0    0x01
#define MASK_CLK_SMED1_CK_SW1    0x02
#define MASK_CLK_SMED1_SMED_1_DIV 0x70

#define MASK_CLK_SMED2_CK_SW0    0x01
#define MASK_CLK_SMED2_CK_SW1    0x02
#define MASK_CLK_SMED2_SMED_2_DIV 0x70

#define MASK_CLK_SMED3_CK_SW0    0x01
#define MASK_CLK_SMED3_CK_SW1    0x02
#define MASK_CLK_SMED3_SMED_3_DIV 0x70

#define MASK_CLK_SMED4_CK_SW0    0x01
#define MASK_CLK_SMED4_CK_SW1    0x02
#define MASK_CLK_SMED4_SMED_4_DIV 0x70

#define MASK_CLK_SMED5_CK_SW0    0x01
#define MASK_CLK_SMED5_CK_SW1    0x02
#define MASK_CLK_SMED5_SMED_5_DIV 0x70

#define MASK_CLK_PLLDIVR_PLL_DIV 0x03
#define MASK_CLK_PLLDIVR_PLL_PRES_DIV 0x18

#define MASK_CLK_AWUDIVR_AWUDIV0 0x01
#define MASK_CLK_AWUDIVR_AWUDIV1 0x02
#define MASK_CLK_AWUDIVR_AWUDIV2 0x04
#define MASK_CLK_AWUDIVR_AWUDIV3 0x08

#define MASK_CLK_ICKR_HSIEN      0x01
#define MASK_CLK_ICKR_HSIRDY     0x02
#define MASK_CLK_ICKR_FHW        0x04
#define MASK_CLK_ICKR_LSIEN      0x08
#define MASK_CLK_ICKR_LSIRDY     0x10
#define MASK_CLK_ICKR_REGAH      0x20

#define MASK_CLK_ECKR_HSEEN      0x01
#define MASK_CLK_ECKR_HSERDY     0x02

#define MASK_CLK_PLLR_PLLON      0x01
#define MASK_CLK_PLLR_LOCKP      0x02
#define MASK_CLK_PLLR_REF_SEL    0x04
#define MASK_CLK_PLLR_BYPASS     0x08
#define MASK_CLK_PLLR_SSCG_CTRL  0x10
#define MASK_CLK_PLLR_SPREAD_CTRL 0x20
#define MASK_CLK_PLLR_PLL_LOCK_INT 0x40

#define MASK_CLK_CMSR_CKM        0x0F
#define MASK_CLK_CMSR_NCKM       0xF0

