yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostwbc.h
#define ADC_SOC_SOC              ADC_SOC_bit.SOC

#define ADC_IER_EOC_EN           ADC_IER_bit.EOC_EN
#define ADC_IER_EOS_EN           ADC_IER_bit.EOS_EN
#define ADC_IER_SEQ_FULL_EN      ADC_IER_bit.SEQ_FULL_EN

#define ADC_SEQ_CH               ADC_SEQ_bit.CH
#define ADC_SEQ_GAIN             ADC_SEQ_bit.GAIN

#define ADC_DATH_0_DATA_HIGH     ADC_DATH_0_bit.DATA_HIGH

#define ADC_DATH_1_DATA_HIGH     ADC_DATH_1_bit.DATA_HIGH

#define ADC_DATH_2_DATA_HIGH     ADC_DATH_2_bit.DATA_HIGH

#define ADC_DATH_3_DATA_HIGH     ADC_DATH_3_bit.DATA_HIGH

#define ADC_DATH_4_DATA_HIGH     ADC_DATH_4_bit.DATA_HIGH

#define ADC_DATH_5_DATA_HIGH     ADC_DATH_5_bit.DATA_HIGH

#define ADC_DATH_6_DATA_HIGH     ADC_DATH_6_bit.DATA_HIGH

#define ADC_DATH_7_DATA_HIGH     ADC_DATH_7_bit.DATA_HIGH

#define ADC_SR_EOC               ADC_SR_bit.EOC
#define ADC_SR_EOS               ADC_SR_bit.EOS
#define ADC_SR_SEQ_FULL          ADC_SR_bit.SEQ_FULL

#endif

/*-------------------------------------------------------------------------
 *      ADC Registers bit masks
 *-----------------------------------------------------------------------*/
#define MASK_ADC_CFG_PD          0x01
#define MASK_ADC_CFG_STOP        0x02
#define MASK_ADC_CFG_FIFO_FLUSH  0x04
#define MASK_ADC_CFG_CIRCULAR    0x08
#define MASK_ADC_CFG_FORMAT      0x10

#define MASK_ADC_SOC_SOC         0x01

#define MASK_ADC_IER_EOC_EN      0x01
#define MASK_ADC_IER_EOS_EN      0x02
#define MASK_ADC_IER_SEQ_FULL_EN 0x04

#define MASK_ADC_SEQ_CH          0x07
#define MASK_ADC_SEQ_GAIN        0x08

#define MASK_ADC_DATH_0_DATA_HIGH 0x03

#define MASK_ADC_DATH_1_DATA_HIGH 0x03

#define MASK_ADC_DATH_2_DATA_HIGH 0x03

#define MASK_ADC_DATH_3_DATA_HIGH 0x03

#define MASK_ADC_DATH_4_DATA_HIGH 0x03

#define MASK_ADC_DATH_5_DATA_HIGH 0x03

#define MASK_ADC_DATH_6_DATA_HIGH 0x03

#define MASK_ADC_DATH_7_DATA_HIGH 0x03

#define MASK_ADC_SR_EOC          0x01
#define MASK_ADC_SR_EOS          0x02
#define MASK_ADC_SR_SEQ_FULL     0x04


/*-------------------------------------------------------------------------
 *      SMED 0 Registers register definitions
 *-----------------------------------------------------------------------*/
/* Control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char START_CNT   : 1;
  unsigned char FSM_ENA     : 1;
} __BITS_SMD0_CTR;
#endif
__IO_REG8_BIT(SMD0_CTR,    0x5500, __READ_WRITE, __BITS_SMD0_CTR);

/* Control timer register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIME_T0_VAL : 1;
  unsigned char TIME_T1_VAL : 1;
  unsigned char TIME_T2_VAL : 1;
  unsigned char TIME_T3_VAL : 1;
  unsigned char DITHER_VAL  : 1;
} __BITS_SMD0_CTR_TMR;
#endif
__IO_REG8_BIT(SMD0_CTR_TMR, 0x5501, __READ_WRITE, __BITS_SMD0_CTR_TMR);

/* Control input register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RS_INSIG0   : 1;
  unsigned char RS_INSIG1   : 1;
  unsigned char RS_INSIG2   : 1;
  unsigned char RAIS_EN     : 1;
  unsigned char EL_INSIG0   : 1;
  unsigned char EL_INSIG1   : 1;
  unsigned char EL_INSIG2   : 1;
  unsigned char EL_EN       : 1;
} __BITS_SMD0_CTR_INP;
#endif
__IO_REG8_BIT(SMD0_CTR_INP, 0x5502, __READ_WRITE, __BITS_SMD0_CTR_INP);

/* Dithering register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DITH0       : 1;
  unsigned char DITH1       : 1;
  unsigned char DITH2       : 1;
  unsigned char DITH3       : 1;
  unsigned char DITH4       : 1;
  unsigned char DITH5       : 1;
  unsigned char DITH6       : 1;
  unsigned char DITH7       : 1;
} __BITS_SMD0_CTR_DTHR;
#endif
__IO_REG8_BIT(SMD0_CTR_DTHR, 0x5503, __READ_WRITE, __BITS_SMD0_CTR_DTHR);

/* Time T0 lsb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T0L0    : 1;
  unsigned char TIM_T0L1    : 1;
  unsigned char TIM_T0L2    : 1;
  unsigned char TIM_T0L3    : 1;
  unsigned char TIM_T0L4    : 1;
  unsigned char TIM_T0L5    : 1;
  unsigned char TIM_T0L6    : 1;
  unsigned char TIM_T0L7    : 1;
} __BITS_SMD0_TMR_T0L;
#endif
__IO_REG8_BIT(SMD0_TMR_T0L, 0x5504, __READ_WRITE, __BITS_SMD0_TMR_T0L);

/* Time T0 msb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T0H0    : 1;
  unsigned char TIM_T0H1    : 1;
  unsigned char TIM_T0H2    : 1;
  unsigned char TIM_T0H3    : 1;
  unsigned char TIM_T0H4    : 1;
  unsigned char TIM_T0H5    : 1;
  unsigned char TIM_T0H6    : 1;
  unsigned char TIM_T0H7    : 1;
} __BITS_SMD0_TMR_T0H;
#endif
__IO_REG8_BIT(SMD0_TMR_T0H, 0x5505, __READ_WRITE, __BITS_SMD0_TMR_T0H);

/* Time T1 lsb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T1L0    : 1;
  unsigned char TIM_T1L1    : 1;
  unsigned char TIM_T1L2    : 1;
  unsigned char TIM_T1L3    : 1;
  unsigned char TIM_T1L4    : 1;
  unsigned char TIM_T1L5    : 1;
  unsigned char TIM_T1L6    : 1;
  unsigned char TIM_T1L7    : 1;
} __BITS_SMD0_TMR_T1L;
#endif
__IO_REG8_BIT(SMD0_TMR_T1L, 0x5506, __READ_WRITE, __BITS_SMD0_TMR_T1L);

/* Time T1 msb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T1H0    : 1;
  unsigned char TIM_T1H1    : 1;
  unsigned char TIM_T1H2    : 1;
  unsigned char TIM_T1H3    : 1;
  unsigned char TIM_T1H4    : 1;
  unsigned char TIM_T1H5    : 1;
  unsigned char TIM_T1H6    : 1;
  unsigned char TIM_T1H7    : 1;
} __BITS_SMD0_TMR_T1H;
#endif
__IO_REG8_BIT(SMD0_TMR_T1H, 0x5507, __READ_WRITE, __BITS_SMD0_TMR_T1H);

/* Time T2 lsb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T2L0    : 1;
  unsigned char TIM_T2L1    : 1;
  unsigned char TIM_T2L2    : 1;
  unsigned char TIM_T2L3    : 1;
  unsigned char TIM_T2L4    : 1;
  unsigned char TIM_T2L5    : 1;
  unsigned char TIM_T2L6    : 1;
  unsigned char TIM_T2L7    : 1;
} __BITS_SMD0_TMR_T2L;
#endif
__IO_REG8_BIT(SMD0_TMR_T2L, 0x5508, __READ_WRITE, __BITS_SMD0_TMR_T2L);

