yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostwbc.h
#define MASK_SMD5_PRM_ID0_NX_STAT0 0x01
#define MASK_SMD5_PRM_ID0_NX_STAT1 0x02
#define MASK_SMD5_PRM_ID0_EDGE0  0x04
#define MASK_SMD5_PRM_ID0_EDGE1  0x08
#define MASK_SMD5_PRM_ID0_CNT_RSTE 0x10
#define MASK_SMD5_PRM_ID0_PULS_EDG 0x20
#define MASK_SMD5_PRM_ID0_HOLD_JMP 0x40
#define MASK_SMD5_PRM_ID0_AND_OR 0x80

#define MASK_SMD5_PRM_ID1_CEDGE0 0x04
#define MASK_SMD5_PRM_ID1_CEDGE1 0x08
#define MASK_SMD5_PRM_ID1_CNT_RSTC 0x10
#define MASK_SMD5_PRM_ID1_PULS_CMP 0x20
#define MASK_SMD5_PRM_ID1_HOLD_EXIT 0x40

#define MASK_SMD5_PRM_ID2_LATCH_RS 0x01

#define MASK_SMD5_PRM_S00_NX_STAT0 0x01
#define MASK_SMD5_PRM_S00_NX_STAT1 0x02
#define MASK_SMD5_PRM_S00_EDGE0  0x04
#define MASK_SMD5_PRM_S00_EDGE1  0x08
#define MASK_SMD5_PRM_S00_CNT_RSTE 0x10
#define MASK_SMD5_PRM_S00_PULS_EDG 0x20
#define MASK_SMD5_PRM_S00_HOLD_JMP 0x40
#define MASK_SMD5_PRM_S00_AND_OR 0x80

#define MASK_SMD5_PRM_S01_CEDGE0 0x04
#define MASK_SMD5_PRM_S01_CEDGE1 0x08
#define MASK_SMD5_PRM_S01_CNT_RSTC 0x10
#define MASK_SMD5_PRM_S01_PULS_CMP 0x20
#define MASK_SMD5_PRM_S01_HOLD_EXIT 0x40

#define MASK_SMD5_PRM_S02_LATCH_RS 0x01

#define MASK_SMD5_PRM_S10_NX_STAT0 0x01
#define MASK_SMD5_PRM_S10_NX_STAT1 0x02
#define MASK_SMD5_PRM_S10_EDGE0  0x04
#define MASK_SMD5_PRM_S10_EDGE1  0x08
#define MASK_SMD5_PRM_S10_CNT_RSTE 0x10
#define MASK_SMD5_PRM_S10_PULS_EDG 0x20
#define MASK_SMD5_PRM_S10_HOLD_JMP 0x40
#define MASK_SMD5_PRM_S10_AND_OR 0x80

#define MASK_SMD5_PRM_S11_CEDGE0 0x04
#define MASK_SMD5_PRM_S11_CEDGE1 0x08
#define MASK_SMD5_PRM_S11_CNT_RSTC 0x10
#define MASK_SMD5_PRM_S11_PULS_CMP 0x20
#define MASK_SMD5_PRM_S11_HOLD_EXIT 0x40

#define MASK_SMD5_PRM_S12_LATCH_RS 0x01

#define MASK_SMD5_PRM_S20_NX_STAT0 0x01
#define MASK_SMD5_PRM_S20_NX_STAT1 0x02
#define MASK_SMD5_PRM_S20_EDGE0  0x04
#define MASK_SMD5_PRM_S20_EDGE1  0x08
#define MASK_SMD5_PRM_S20_CNT_RSTE 0x10
#define MASK_SMD5_PRM_S20_PULS_EDG 0x20
#define MASK_SMD5_PRM_S20_HOLD_JMP 0x40
#define MASK_SMD5_PRM_S20_AND_OR 0x80

#define MASK_SMD5_PRM_S21_CEDGE0 0x04
#define MASK_SMD5_PRM_S21_CEDGE1 0x08
#define MASK_SMD5_PRM_S21_CNT_RSTC 0x10
#define MASK_SMD5_PRM_S21_PULS_CMP 0x20
#define MASK_SMD5_PRM_S21_HOLD_EXIT 0x40

#define MASK_SMD5_PRM_S22_LATCH_RS 0x01

#define MASK_SMD5_PRM_S30_NX_STAT0 0x01
#define MASK_SMD5_PRM_S30_NX_STAT1 0x02
#define MASK_SMD5_PRM_S30_EDGE0  0x04
#define MASK_SMD5_PRM_S30_EDGE1  0x08
#define MASK_SMD5_PRM_S30_CNT_RSTE 0x10
#define MASK_SMD5_PRM_S30_PULS_EDG 0x20
#define MASK_SMD5_PRM_S30_HOLD_JMP 0x40
#define MASK_SMD5_PRM_S30_AND_OR 0x80

#define MASK_SMD5_PRM_S31_CEDGE0 0x04
#define MASK_SMD5_PRM_S31_CEDGE1 0x08
#define MASK_SMD5_PRM_S31_CNT_RSTC 0x10
#define MASK_SMD5_PRM_S31_PULS_CMP 0x20
#define MASK_SMD5_PRM_S31_HOLD_EXIT 0x40

#define MASK_SMD5_PRM_S32_LATCH_RS 0x01

#define MASK_SMD5_CFG_TIM_NUM0   0x02
#define MASK_SMD5_CFG_TIM_NUM1   0x04
#define MASK_SMD5_CFG_TIM_UPD0   0x08
#define MASK_SMD5_CFG_TIM_UPD1   0x10

#define MASK_SMD5_DMP_L_CNT_LO0  0x01
#define MASK_SMD5_DMP_L_CNT_LO1  0x02
#define MASK_SMD5_DMP_L_CNT_LO2  0x04
#define MASK_SMD5_DMP_L_CNT_LO3  0x08
#define MASK_SMD5_DMP_L_CNT_LO4  0x10
#define MASK_SMD5_DMP_L_CNT_LO5  0x20
#define MASK_SMD5_DMP_L_CNT_LO6  0x40
#define MASK_SMD5_DMP_L_CNT_LO7  0x80

#define MASK_SMD5_DMP_H_CNT_LH0  0x01
#define MASK_SMD5_DMP_H_CNT_LH1  0x02
#define MASK_SMD5_DMP_H_CNT_LH2  0x04
#define MASK_SMD5_DMP_H_CNT_LH3  0x08
#define MASK_SMD5_DMP_H_CNT_LH4  0x10
#define MASK_SMD5_DMP_H_CNT_LH5  0x20
#define MASK_SMD5_DMP_H_CNT_LH6  0x40
#define MASK_SMD5_DMP_H_CNT_LH7  0x80

#define MASK_SMD5_GSTS_EX0_DUMP  0x01
#define MASK_SMD5_GSTS_EX1_DUMP  0x02
#define MASK_SMD5_GSTS_EX2_DUMP  0x04
#define MASK_SMD5_GSTS_CNT_FLAG  0x08
#define MASK_SMD5_GSTS_DMP_LK0   0x10
#define MASK_SMD5_GSTS_DMP_LK1   0x20
#define MASK_SMD5_GSTS_EVENT_OV  0x40

#define MASK_SMD5_ISR_CNT_OVER   0x01
#define MASK_SMD5_ISR_EXT0_INT   0x02
#define MASK_SMD5_ISR_EXT1_INT   0x04
#define MASK_SMD5_ISR_EXT2_INT   0x08
#define MASK_SMD5_ISR_STA_S0_IT  0x10
#define MASK_SMD5_ISR_STA_S1_IT  0x20
#define MASK_SMD5_ISR_STA_S2_IT  0x40
#define MASK_SMD5_ISR_STA_S3_IT  0x80

#define MASK_SMD5_IMR_CNT_OV_R   0x01
#define MASK_SMD5_IMR_IT_EXT0    0x02
#define MASK_SMD5_IMR_IT_EXT1    0x04
#define MASK_SMD5_IMR_IT_EXT2    0x08
#define MASK_SMD5_IMR_IT_STA_S0  0x10
#define MASK_SMD5_IMR_IT_STA_S1  0x20
#define MASK_SMD5_IMR_IT_STA_S2  0x40
#define MASK_SMD5_IMR_IT_STA_S3  0x80

#define MASK_SMD5_ISEL_INPUT0_EN 0x01
#define MASK_SMD5_ISEL_INPUT1_EN 0x02
#define MASK_SMD5_ISEL_INPUT2_EN 0x04
#define MASK_SMD5_ISEL_INPUT_LAT 0x08

#define MASK_SMD5_DMP_DMPE_EX0   0x01
#define MASK_SMD5_DMP_DMPE_EX1   0x02
#define MASK_SMD5_DMP_DMPE_EX2   0x04
#define MASK_SMD5_DMP_DMP_EVER   0x08
#define MASK_SMD5_DMP_CPL_IT_GE  0x10

#define MASK_SMD5_FSM_STS_FSM0   0x01
#define MASK_SMD5_FSM_STS_FSM1   0x02
#define MASK_SMD5_FSM_STS_FSM2   0x04
#define MASK_SMD5_FSM_STS_PWM    0x08
#define MASK_SMD5_FSM_STS_EVINP0 0x10
#define MASK_SMD5_FSM_STS_EVINP1 0x20
#define MASK_SMD5_FSM_STS_EVINP2 0x40


/*-------------------------------------------------------------------------
 *      System Registers register definitions
 *-----------------------------------------------------------------------*/
/* Global configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SWD         : 1;
  unsigned char AL          : 1;
  unsigned char             : 5;
  unsigned char HSIT        : 1;
} __BITS_CFG_GCR;
#endif
__IO_REG8_BIT(CFG_GCR,     0x7F60, __READ_WRITE, __BITS_CFG_GCR);

/* SWIM control status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SWIM_PRI    : 1;
  unsigned char OBL         : 1;
  unsigned char RST         : 1;
  unsigned char OSCOFF      : 1;
  unsigned char HS          : 1;
  unsigned char SWIM_DM     : 1;
  unsigned char HALT        : 1;
  unsigned char SAFE_MASK   : 1;
} __BITS_SWIM_CSR;
#endif
__IO_REG8_BIT(SWIM_CSR,    0x7F80, __READ_WRITE, __BITS_SWIM_CSR);


/*-------------------------------------------------------------------------
 *      System Registers bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define CFG_GCR_SWD              CFG_GCR_bit.SWD
#define CFG_GCR_AL               CFG_GCR_bit.AL
#define CFG_GCR_HSIT             CFG_GCR_bit.HSIT

#define SWIM_CSR_SWIM_PRI        SWIM_CSR_bit.SWIM_PRI
#define SWIM_CSR_OBL             SWIM_CSR_bit.OBL
#define SWIM_CSR_RST             SWIM_CSR_bit.RST
#define SWIM_CSR_OSCOFF          SWIM_CSR_bit.OSCOFF
#define SWIM_CSR_HS              SWIM_CSR_bit.HS
#define SWIM_CSR_SWIM_DM         SWIM_CSR_bit.SWIM_DM
#define SWIM_CSR_HALT            SWIM_CSR_bit.HALT
#define SWIM_CSR_SAFE_MASK       SWIM_CSR_bit.SAFE_MASK

#endif

/*-------------------------------------------------------------------------
 *      System Registers bit masks
 *-----------------------------------------------------------------------*/
#define MASK_CFG_GCR_SWD         0x01
#define MASK_CFG_GCR_AL          0x02
#define MASK_CFG_GCR_HSIT        0x80

#define MASK_SWIM_CSR_SWIM_PRI   0x01
#define MASK_SWIM_CSR_OBL        0x02
#define MASK_SWIM_CSR_RST        0x04
#define MASK_SWIM_CSR_OSCOFF     0x08
#define MASK_SWIM_CSR_HS         0x10
#define MASK_SWIM_CSR_SWIM_DM    0x20
#define MASK_SWIM_CSR_HALT       0x40
#define MASK_SWIM_CSR_SAFE_MASK  0x80


/*-------------------------------------------------------------------------
 *      ITC register definitions
 *-----------------------------------------------------------------------*/
/* Interrupt software priority register 0 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 2;
  unsigned char VECT1SPR    : 2;
  unsigned char VECT2SPR    : 2;
  unsigned char VECT3SPR    : 2;
} __BITS_ITC_SPR0;
#endif
__IO_REG8_BIT(ITC_SPR0,    0x7F70, __READ_WRITE, __BITS_ITC_SPR0);

